# MaximumBendRadius Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarBarType..::..MaximumBendRadius Property
RebarBarType Class See Also
---
Defines maximum bend radius of rebar
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public double MaximumBendRadius { get; set; }
```

Visual Basic
---
```text
Public Property MaximumBendRadius As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MaximumBendRadius {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for maximumBendRadius is not a number |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: maximumBendRadius must be greater than 0 and no more than 30000. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace